app/controllers/transactions_controller.rb

  def index
    @transactions = Transaction.all
---
SELECT `transactions`.* FROM `transactions`

  def create
    @transaction= Transaction.new(transaction_params)
    @transaction.user_id = current_user.id
    respond_to do |format|
      if @transaction.save
---
INSERT INTO `transactions` (`trans_amount`, `user_id`, `trans_type`, `created_at`, `updated_at`) VALUES (2243.0, 1, 1, '2017-08-27 09:50:31', '2017-08-27 09:50:31')

  def edit
    @transaction = Transaction.find(params[:id])
---
SELECT  `transactions`.* FROM `transactions` WHERE `transactions`.`id` = 1 LIMIT 1

  def update
    respond_to do |format|
      if @transaction.update_attributes(transaction_params)
---
UPDATE `transactions` SET `trans_type` = 0, `trans_amount` = 111.0, `updated_at` = '2017-08-27 10:23:39' WHERE `transactions`.`id` = 2

  def set_transactions
    @transaction = Transaction.find_by_id(params[:id])
---
SELECT  `transactions`.* FROM `transactions` WHERE `transactions`.`id` = 1 LIMIT 1